Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risaf.h
/*
; stm32V873_risaf.
; ================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32V873_risaf equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// RISAF address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    IASR;
    volatile    uint32_t    IACR;
    volatile    uint32_t    RESERVED1[4];
    volatile    uint32_t    IAESR;
    volatile    uint32_t    IADDR;
    volatile    uint32_t    RESERVED2[6];
    volatile    uint32_t    REG1_CFGR;
    volatile    uint32_t    REG1_STARTR;
    volatile    uint32_t    REG1_ENDR;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    REG1_ACFGR;
    volatile    uint32_t    REG1_ASTARTR;
    volatile    uint32_t    REG1_AENDR;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    REG1_BCFGR;
    volatile    uint32_t    REG1_BSTARTR;
    volatile    uint32_t    REG1_BENDR;
    volatile    uint32_t    RESERVED5[5];
    volatile    uint32_t    REG2_CFGR;
    volatile    uint32_t    REG2_STARTR;
    volatile    uint32_t    REG2_ENDR;
    volatile    uint32_t    RESERVED6;
    volatile    uint32_t    REG2_ACFGR;
    volatile    uint32_t    REG2_ASTARTR;
    volatile    uint32_t    REG2_AENDR;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    REG2_BCFGR;
    volatile    uint32_t    REG2_BSTARTR;
    volatile    uint32_t    REG2_BENDR;
    volatile    uint32_t    RESERVED8[5];
    volatile    uint32_t    REG3_CFGR;
    volatile    uint32_t    REG3_STARTR;
    volatile    uint32_t    REG3_ENDR;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    REG3_ACFGR;
    volatile    uint32_t    REG3_ASTARTR;
    volatile    uint32_t    REG3_AENDR;
    volatile    uint32_t    RESERVED10;
    volatile    uint32_t    REG3_BCFGR;
    volatile    uint32_t    REG3_BSTARTR;
    volatile    uint32_t    REG3_BENDR;
    volatile    uint32_t    RESERVED11[5];
    volatile    uint32_t    REG4_CFGR;
    volatile    uint32_t    REG4_STARTR;
    volatile    uint32_t    REG4_ENDR;
    volatile    uint32_t    RESERVED12;
    volatile    uint32_t    REG4_ACFGR;
    volatile    uint32_t    REG4_ASTARTR;
    volatile    uint32_t    REG4_AENDR;
    volatile    uint32_t    RESERVED13;
    volatile    uint32_t    REG4_BCFGR;
    volatile    uint32_t    REG4_BSTARTR;
    volatile    uint32_t    REG4_BENDR;
    volatile    uint32_t    RESERVED14[5];
    volatile    uint32_t    REG5_CFGR;
    volatile    uint32_t    REG5_STARTR;
    volatile    uint32_t    REG5_ENDR;
    volatile    uint32_t    RESERVED15;
    volatile    uint32_t    REG5_ACFGR;
    volatile    uint32_t    REG5_ASTARTR;
    volatile    uint32_t    REG5_AENDR;
    volatile    uint32_t    RESERVED16;
    volatile    uint32_t    REG5_BCFGR;
    volatile    uint32_t    REG5_BSTARTR;
    volatile    uint32_t    REG5_BENDR;
    volatile    uint32_t    RESERVED17[5];
    volatile    uint32_t    REG6_CFGR;
    volatile    uint32_t    REG6_STARTR;
    volatile    uint32_t    REG6_ENDR;
    volatile    uint32_t    RESERVED18;
    volatile    uint32_t    REG6_ACFGR;
    volatile    uint32_t    REG6_ASTARTR;
    volatile    uint32_t    REG6_AENDR;
    volatile    uint32_t    RESERVED19;
    volatile    uint32_t    REG6_BCFGR;
    volatile    uint32_t    REG6_BSTARTR;
    volatile    uint32_t    REG6_BENDR;
    volatile    uint32_t    RESERVED20[5];
    volatile    uint32_t    REG7_CFGR;
    volatile    uint32_t    REG7_STARTR;
    volatile    uint32_t    REG7_ENDR;
    volatile    uint32_t    RESERVED21;
    volatile    uint32_t    REG7_ACFGR;
    volatile    uint32_t    REG7_ASTARTR;
    volatile    uint32_t    REG7_AENDR;
    volatile    uint32_t    RESERVED22;
    volatile    uint32_t    REG7_BCFGR;
    volatile    uint32_t    REG7_BSTARTR;
    volatile    uint32_t    REG7_BENDR;
} RISAF_TypeDef;

#if (defined(__cplusplus))
#define RISAF_NS    reinterpret_cast<RISAF_TypeDef *>(0x480FE000u)
#define RISAF_S     reinterpret_cast<RISAF_TypeDef *>(0x580FE000u)

#else
#define RISAF_NS    ((RISAF_TypeDef *)0x480FE000u)
#define RISAF_S     ((RISAF_TypeDef *)0x580FE000u)
#endif

