Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risaf.h
// CR Configuration

#define RISAF_CR_GLOCK                  (0x1u<<0)

#define RISAF_CR_GLOCK_B_0X0            (0x0u<<0)
#define RISAF_CR_GLOCK_B_0X1            (0x1u<<0)

// IASR Configuration

#define RISAF_IASR_IAEF                 (0x1u<<1)
#define RISAF_IASR_CAEF                 (0x1u<<0)

// IACR Configuration

#define RISAF_IACR_IAEF                 (0x1u<<1)
#define RISAF_IACR_CAEF                 (0x1u<<0)

// IAESR Configuration

#define RISAF_IAESR_IANRW               (0x1u<<7)
#define RISAF_IAESR_IASEC               (0x1u<<5)
#define RISAF_IAESR_IAPRIV              (0x1u<<4)

#define RISAF_IAESR_IANRW_B_0X0         (0x0u<<7)
#define RISAF_IAESR_IANRW_B_0X1         (0x1u<<7)
#define RISAF_IAESR_IASEC_B_0X0         (0x0u<<5)
#define RISAF_IAESR_IASEC_B_0X1         (0x1u<<5)
#define RISAF_IAESR_IAPRIV_B_0X0        (0x0u<<4)
#define RISAF_IAESR_IAPRIV_B_0X1        (0x1u<<4)

// IADDR Configuration

#define RISAF_IADDR_IADD                (0xFFFFFFFFu<<0)
#define RISAF_IADDR_IADD_0              (0x1u<<0)

// REG1_CFGR Configuration

#define RISAF_REG1_CFGR_SEC             (0x1u<<8)
#define RISAF_REG1_CFGR_BREN            (0x1u<<0)

#define RISAF_REG1_CFGR_SEC_B_0X0       (0x0u<<8)
#define RISAF_REG1_CFGR_SEC_B_0X1       (0x1u<<8)
#define RISAF_REG1_CFGR_BREN_B_0X0      (0x0u<<0)
#define RISAF_REG1_CFGR_BREN_B_0X1      (0x1u<<0)

// REG1_STARTR Configuration

#define RISAF_REG1_STARTR_BADDSTART     (0xFFFFFFFFu<<0)
#define RISAF_REG1_STARTR_BADDSTART_0   (0x1u<<0)

// REG1_ENDR Configuration

#define RISAF_REG1_ENDR_BADDEND         (0xFFFFFFFFu<<0)
#define RISAF_REG1_ENDR_BADDEND_0       (0x1u<<0)

// REG1_ACFGR Configuration

#define RISAF_REG1_ACFGR_WREN           (0x1u<<13)
#define RISAF_REG1_ACFGR_RDEN           (0x1u<<12)
#define RISAF_REG1_ACFGR_PRIV           (0x1u<<9)
#define RISAF_REG1_ACFGR_SEC            (0x1u<<8)
#define RISAF_REG1_ACFGR_RLOCK          (0x1u<<1)
#define RISAF_REG1_ACFGR_SREN           (0x1u<<0)

#define RISAF_REG1_ACFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG1_ACFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG1_ACFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG1_ACFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG1_ACFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG1_ACFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG1_ACFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG1_ACFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG1_ACFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG1_ACFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG1_ACFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG1_ACFGR_SREN_B_0X1     (0x1u<<0)

// REG1_ASTARTR Configuration

#define RISAF_REG1_ASTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG1_ASTARTR_SADDSTART_0  (0x1u<<0)

// REG1_AENDR Configuration

#define RISAF_REG1_AENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG1_AENDR_SADDEND_0      (0x1u<<0)

// REG1_BCFGR Configuration

#define RISAF_REG1_BCFGR_WREN           (0x1u<<13)
#define RISAF_REG1_BCFGR_RDEN           (0x1u<<12)
#define RISAF_REG1_BCFGR_PRIV           (0x1u<<9)
#define RISAF_REG1_BCFGR_SEC            (0x1u<<8)
#define RISAF_REG1_BCFGR_RLOCK          (0x1u<<1)
#define RISAF_REG1_BCFGR_SREN           (0x1u<<0)

#define RISAF_REG1_BCFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG1_BCFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG1_BCFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG1_BCFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG1_BCFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG1_BCFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG1_BCFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG1_BCFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG1_BCFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG1_BCFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG1_BCFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG1_BCFGR_SREN_B_0X1     (0x1u<<0)

// REG1_BSTARTR Configuration

#define RISAF_REG1_BSTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG1_BSTARTR_SADDSTART_0  (0x1u<<0)

// REG1_BENDR Configuration

#define RISAF_REG1_BENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG1_BENDR_SADDEND_0      (0x1u<<0)

// REG2_CFGR Configuration

#define RISAF_REG2_CFGR_SEC             (0x1u<<8)
#define RISAF_REG2_CFGR_BREN            (0x1u<<0)

#define RISAF_REG2_CFGR_SEC_B_0X0       (0x0u<<8)
#define RISAF_REG2_CFGR_SEC_B_0X1       (0x1u<<8)
#define RISAF_REG2_CFGR_BREN_B_0X0      (0x0u<<0)
#define RISAF_REG2_CFGR_BREN_B_0X1      (0x1u<<0)

// REG2_STARTR Configuration

#define RISAF_REG2_STARTR_BADDSTART     (0xFFFFFFFFu<<0)
#define RISAF_REG2_STARTR_BADDSTART_0   (0x1u<<0)

// REG2_ENDR Configuration

#define RISAF_REG2_ENDR_BADDEND         (0xFFFFFFFFu<<0)
#define RISAF_REG2_ENDR_BADDEND_0       (0x1u<<0)

// REG2_ACFGR Configuration

#define RISAF_REG2_ACFGR_WREN           (0x1u<<13)
#define RISAF_REG2_ACFGR_RDEN           (0x1u<<12)
#define RISAF_REG2_ACFGR_PRIV           (0x1u<<9)
#define RISAF_REG2_ACFGR_SEC            (0x1u<<8)
#define RISAF_REG2_ACFGR_RLOCK          (0x1u<<1)
#define RISAF_REG2_ACFGR_SREN           (0x1u<<0)

#define RISAF_REG2_ACFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG2_ACFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG2_ACFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG2_ACFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG2_ACFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG2_ACFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG2_ACFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG2_ACFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG2_ACFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG2_ACFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG2_ACFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG2_ACFGR_SREN_B_0X1     (0x1u<<0)

// REG2_ASTARTR Configuration

#define RISAF_REG2_ASTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG2_ASTARTR_SADDSTART_0  (0x1u<<0)

// REG2_AENDR Configuration

#define RISAF_REG2_AENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG2_AENDR_SADDEND_0      (0x1u<<0)

// REG2_BCFGR Configuration

#define RISAF_REG2_BCFGR_WREN           (0x1u<<13)
#define RISAF_REG2_BCFGR_RDEN           (0x1u<<12)
#define RISAF_REG2_BCFGR_PRIV           (0x1u<<9)
#define RISAF_REG2_BCFGR_SEC            (0x1u<<8)
#define RISAF_REG2_BCFGR_RLOCK          (0x1u<<1)
#define RISAF_REG2_BCFGR_SREN           (0x1u<<0)

#define RISAF_REG2_BCFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG2_BCFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG2_BCFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG2_BCFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG2_BCFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG2_BCFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG2_BCFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG2_BCFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG2_BCFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG2_BCFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG2_BCFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG2_BCFGR_SREN_B_0X1     (0x1u<<0)

