Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risaf.h
// REG2_BSTARTR Configuration

#define RISAF_REG2_BSTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG2_BSTARTR_SADDSTART_0  (0x1u<<0)

// REG2_BENDR Configuration

#define RISAF_REG2_BENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG2_BENDR_SADDEND_0      (0x1u<<0)

// REG3_CFGR Configuration

#define RISAF_REG3_CFGR_SEC             (0x1u<<8)
#define RISAF_REG3_CFGR_BREN            (0x1u<<0)

#define RISAF_REG3_CFGR_SEC_B_0X0       (0x0u<<8)
#define RISAF_REG3_CFGR_SEC_B_0X1       (0x1u<<8)
#define RISAF_REG3_CFGR_BREN_B_0X0      (0x0u<<0)
#define RISAF_REG3_CFGR_BREN_B_0X1      (0x1u<<0)

// REG3_STARTR Configuration

#define RISAF_REG3_STARTR_BADDSTART     (0xFFFFFFFFu<<0)
#define RISAF_REG3_STARTR_BADDSTART_0   (0x1u<<0)

// REG3_ENDR Configuration

#define RISAF_REG3_ENDR_BADDEND         (0xFFFFFFFFu<<0)
#define RISAF_REG3_ENDR_BADDEND_0       (0x1u<<0)

// REG3_ACFGR Configuration

#define RISAF_REG3_ACFGR_WREN           (0x1u<<13)
#define RISAF_REG3_ACFGR_RDEN           (0x1u<<12)
#define RISAF_REG3_ACFGR_PRIV           (0x1u<<9)
#define RISAF_REG3_ACFGR_SEC            (0x1u<<8)
#define RISAF_REG3_ACFGR_RLOCK          (0x1u<<1)
#define RISAF_REG3_ACFGR_SREN           (0x1u<<0)

#define RISAF_REG3_ACFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG3_ACFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG3_ACFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG3_ACFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG3_ACFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG3_ACFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG3_ACFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG3_ACFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG3_ACFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG3_ACFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG3_ACFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG3_ACFGR_SREN_B_0X1     (0x1u<<0)

// REG3_ASTARTR Configuration

#define RISAF_REG3_ASTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG3_ASTARTR_SADDSTART_0  (0x1u<<0)

// REG3_AENDR Configuration

#define RISAF_REG3_AENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG3_AENDR_SADDEND_0      (0x1u<<0)

// REG3_BCFGR Configuration

#define RISAF_REG3_BCFGR_WREN           (0x1u<<13)
#define RISAF_REG3_BCFGR_RDEN           (0x1u<<12)
#define RISAF_REG3_BCFGR_PRIV           (0x1u<<9)
#define RISAF_REG3_BCFGR_SEC            (0x1u<<8)
#define RISAF_REG3_BCFGR_RLOCK          (0x1u<<1)
#define RISAF_REG3_BCFGR_SREN           (0x1u<<0)

#define RISAF_REG3_BCFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG3_BCFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG3_BCFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG3_BCFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG3_BCFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG3_BCFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG3_BCFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG3_BCFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG3_BCFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG3_BCFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG3_BCFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG3_BCFGR_SREN_B_0X1     (0x1u<<0)

// REG3_BSTARTR Configuration

#define RISAF_REG3_BSTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG3_BSTARTR_SADDSTART_0  (0x1u<<0)

// REG3_BENDR Configuration

#define RISAF_REG3_BENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG3_BENDR_SADDEND_0      (0x1u<<0)

// REG4_CFGR Configuration

#define RISAF_REG4_CFGR_SEC             (0x1u<<8)
#define RISAF_REG4_CFGR_BREN            (0x1u<<0)

#define RISAF_REG4_CFGR_SEC_B_0X0       (0x0u<<8)
#define RISAF_REG4_CFGR_SEC_B_0X1       (0x1u<<8)
#define RISAF_REG4_CFGR_BREN_B_0X0      (0x0u<<0)
#define RISAF_REG4_CFGR_BREN_B_0X1      (0x1u<<0)

// REG4_STARTR Configuration

#define RISAF_REG4_STARTR_BADDSTART     (0xFFFFFFFFu<<0)
#define RISAF_REG4_STARTR_BADDSTART_0   (0x1u<<0)

// REG4_ENDR Configuration

#define RISAF_REG4_ENDR_BADDEND         (0xFFFFFFFFu<<0)
#define RISAF_REG4_ENDR_BADDEND_0       (0x1u<<0)

// REG4_ACFGR Configuration

#define RISAF_REG4_ACFGR_WREN           (0x1u<<13)
#define RISAF_REG4_ACFGR_RDEN           (0x1u<<12)
#define RISAF_REG4_ACFGR_PRIV           (0x1u<<9)
#define RISAF_REG4_ACFGR_SEC            (0x1u<<8)
#define RISAF_REG4_ACFGR_RLOCK          (0x1u<<1)
#define RISAF_REG4_ACFGR_SREN           (0x1u<<0)

#define RISAF_REG4_ACFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG4_ACFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG4_ACFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG4_ACFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG4_ACFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG4_ACFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG4_ACFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG4_ACFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG4_ACFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG4_ACFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG4_ACFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG4_ACFGR_SREN_B_0X1     (0x1u<<0)

// REG4_ASTARTR Configuration

#define RISAF_REG4_ASTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG4_ASTARTR_SADDSTART_0  (0x1u<<0)

// REG4_AENDR Configuration

#define RISAF_REG4_AENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG4_AENDR_SADDEND_0      (0x1u<<0)

// REG4_BCFGR Configuration

#define RISAF_REG4_BCFGR_WREN           (0x1u<<13)
#define RISAF_REG4_BCFGR_RDEN           (0x1u<<12)
#define RISAF_REG4_BCFGR_PRIV           (0x1u<<9)
#define RISAF_REG4_BCFGR_SEC            (0x1u<<8)
#define RISAF_REG4_BCFGR_RLOCK          (0x1u<<1)
#define RISAF_REG4_BCFGR_SREN           (0x1u<<0)

#define RISAF_REG4_BCFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG4_BCFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG4_BCFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG4_BCFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG4_BCFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG4_BCFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG4_BCFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG4_BCFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG4_BCFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG4_BCFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG4_BCFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG4_BCFGR_SREN_B_0X1     (0x1u<<0)

// REG4_BSTARTR Configuration

#define RISAF_REG4_BSTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG4_BSTARTR_SADDSTART_0  (0x1u<<0)

// REG4_BENDR Configuration

#define RISAF_REG4_BENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG4_BENDR_SADDEND_0      (0x1u<<0)

