Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risaf.h
// REG5_CFGR Configuration

#define RISAF_REG5_CFGR_SEC             (0x1u<<8)
#define RISAF_REG5_CFGR_BREN            (0x1u<<0)

#define RISAF_REG5_CFGR_SEC_B_0X0       (0x0u<<8)
#define RISAF_REG5_CFGR_SEC_B_0X1       (0x1u<<8)
#define RISAF_REG5_CFGR_BREN_B_0X0      (0x0u<<0)
#define RISAF_REG5_CFGR_BREN_B_0X1      (0x1u<<0)

// REG5_STARTR Configuration

#define RISAF_REG5_STARTR_BADDSTART     (0xFFFFFFFFu<<0)
#define RISAF_REG5_STARTR_BADDSTART_0   (0x1u<<0)

// REG5_ENDR Configuration

#define RISAF_REG5_ENDR_BADDEND         (0xFFFFFFFFu<<0)
#define RISAF_REG5_ENDR_BADDEND_0       (0x1u<<0)

// REG5_ACFGR Configuration

#define RISAF_REG5_ACFGR_WREN           (0x1u<<13)
#define RISAF_REG5_ACFGR_RDEN           (0x1u<<12)
#define RISAF_REG5_ACFGR_PRIV           (0x1u<<9)
#define RISAF_REG5_ACFGR_SEC            (0x1u<<8)
#define RISAF_REG5_ACFGR_RLOCK          (0x1u<<1)
#define RISAF_REG5_ACFGR_SREN           (0x1u<<0)

#define RISAF_REG5_ACFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG5_ACFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG5_ACFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG5_ACFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG5_ACFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG5_ACFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG5_ACFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG5_ACFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG5_ACFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG5_ACFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG5_ACFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG5_ACFGR_SREN_B_0X1     (0x1u<<0)

// REG5_ASTARTR Configuration

#define RISAF_REG5_ASTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG5_ASTARTR_SADDSTART_0  (0x1u<<0)

// REG5_AENDR Configuration

#define RISAF_REG5_AENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG5_AENDR_SADDEND_0      (0x1u<<0)

// REG5_BCFGR Configuration

#define RISAF_REG5_BCFGR_WREN           (0x1u<<13)
#define RISAF_REG5_BCFGR_RDEN           (0x1u<<12)
#define RISAF_REG5_BCFGR_PRIV           (0x1u<<9)
#define RISAF_REG5_BCFGR_SEC            (0x1u<<8)
#define RISAF_REG5_BCFGR_RLOCK          (0x1u<<1)
#define RISAF_REG5_BCFGR_SREN           (0x1u<<0)

#define RISAF_REG5_BCFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG5_BCFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG5_BCFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG5_BCFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG5_BCFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG5_BCFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG5_BCFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG5_BCFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG5_BCFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG5_BCFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG5_BCFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG5_BCFGR_SREN_B_0X1     (0x1u<<0)

// REG5_BSTARTR Configuration

#define RISAF_REG5_BSTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG5_BSTARTR_SADDSTART_0  (0x1u<<0)

// REG5_BENDR Configuration

#define RISAF_REG5_BENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG5_BENDR_SADDEND_0      (0x1u<<0)

// REG6_CFGR Configuration

#define RISAF_REG6_CFGR_SEC             (0x1u<<8)
#define RISAF_REG6_CFGR_BREN            (0x1u<<0)

#define RISAF_REG6_CFGR_SEC_B_0X0       (0x0u<<8)
#define RISAF_REG6_CFGR_SEC_B_0X1       (0x1u<<8)
#define RISAF_REG6_CFGR_BREN_B_0X0      (0x0u<<0)
#define RISAF_REG6_CFGR_BREN_B_0X1      (0x1u<<0)

// REG6_STARTR Configuration

#define RISAF_REG6_STARTR_BADDSTART     (0xFFFFFFFFu<<0)
#define RISAF_REG6_STARTR_BADDSTART_0   (0x1u<<0)

// REG6_ENDR Configuration

#define RISAF_REG6_ENDR_BADDEND         (0xFFFFFFFFu<<0)
#define RISAF_REG6_ENDR_BADDEND_0       (0x1u<<0)

// REG6_ACFGR Configuration

#define RISAF_REG6_ACFGR_WREN           (0x1u<<13)
#define RISAF_REG6_ACFGR_RDEN           (0x1u<<12)
#define RISAF_REG6_ACFGR_PRIV           (0x1u<<9)
#define RISAF_REG6_ACFGR_SEC            (0x1u<<8)
#define RISAF_REG6_ACFGR_RLOCK          (0x1u<<1)
#define RISAF_REG6_ACFGR_SREN           (0x1u<<0)

#define RISAF_REG6_ACFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG6_ACFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG6_ACFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG6_ACFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG6_ACFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG6_ACFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG6_ACFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG6_ACFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG6_ACFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG6_ACFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG6_ACFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG6_ACFGR_SREN_B_0X1     (0x1u<<0)

// REG6_ASTARTR Configuration

#define RISAF_REG6_ASTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG6_ASTARTR_SADDSTART_0  (0x1u<<0)

// REG6_AENDR Configuration

#define RISAF_REG6_AENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG6_AENDR_SADDEND_0      (0x1u<<0)

// REG6_BCFGR Configuration

#define RISAF_REG6_BCFGR_WREN           (0x1u<<13)
#define RISAF_REG6_BCFGR_RDEN           (0x1u<<12)
#define RISAF_REG6_BCFGR_PRIV           (0x1u<<9)
#define RISAF_REG6_BCFGR_SEC            (0x1u<<8)
#define RISAF_REG6_BCFGR_RLOCK          (0x1u<<1)
#define RISAF_REG6_BCFGR_SREN           (0x1u<<0)

#define RISAF_REG6_BCFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG6_BCFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG6_BCFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG6_BCFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG6_BCFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG6_BCFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG6_BCFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG6_BCFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG6_BCFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG6_BCFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG6_BCFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG6_BCFGR_SREN_B_0X1     (0x1u<<0)

// REG6_BSTARTR Configuration

#define RISAF_REG6_BSTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG6_BSTARTR_SADDSTART_0  (0x1u<<0)

// REG6_BENDR Configuration

#define RISAF_REG6_BENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG6_BENDR_SADDEND_0      (0x1u<<0)

