Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risaf.h
// REG7_CFGR Configuration

#define RISAF_REG7_CFGR_SEC             (0x1u<<8)
#define RISAF_REG7_CFGR_BREN            (0x1u<<0)

#define RISAF_REG7_CFGR_SEC_B_0X0       (0x0u<<8)
#define RISAF_REG7_CFGR_SEC_B_0X1       (0x1u<<8)
#define RISAF_REG7_CFGR_BREN_B_0X0      (0x0u<<0)
#define RISAF_REG7_CFGR_BREN_B_0X1      (0x1u<<0)

// REG7_STARTR Configuration

#define RISAF_REG7_STARTR_BADDSTART     (0xFFFFFFFFu<<0)
#define RISAF_REG7_STARTR_BADDSTART_0   (0x1u<<0)

// REG7_ENDR Configuration

#define RISAF_REG7_ENDR_BADDEND         (0xFFFFFFFFu<<0)
#define RISAF_REG7_ENDR_BADDEND_0       (0x1u<<0)

// REG7_ACFGR Configuration

#define RISAF_REG7_ACFGR_WREN           (0x1u<<13)
#define RISAF_REG7_ACFGR_RDEN           (0x1u<<12)
#define RISAF_REG7_ACFGR_PRIV           (0x1u<<9)
#define RISAF_REG7_ACFGR_SEC            (0x1u<<8)
#define RISAF_REG7_ACFGR_RLOCK          (0x1u<<1)
#define RISAF_REG7_ACFGR_SREN           (0x1u<<0)

#define RISAF_REG7_ACFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG7_ACFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG7_ACFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG7_ACFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG7_ACFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG7_ACFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG7_ACFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG7_ACFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG7_ACFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG7_ACFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG7_ACFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG7_ACFGR_SREN_B_0X1     (0x1u<<0)

// REG7_ASTARTR Configuration

#define RISAF_REG7_ASTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG7_ASTARTR_SADDSTART_0  (0x1u<<0)

// REG7_AENDR Configuration

#define RISAF_REG7_AENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG7_AENDR_SADDEND_0      (0x1u<<0)

// REG7_BCFGR Configuration

#define RISAF_REG7_BCFGR_WREN           (0x1u<<13)
#define RISAF_REG7_BCFGR_RDEN           (0x1u<<12)
#define RISAF_REG7_BCFGR_PRIV           (0x1u<<9)
#define RISAF_REG7_BCFGR_SEC            (0x1u<<8)
#define RISAF_REG7_BCFGR_RLOCK          (0x1u<<1)
#define RISAF_REG7_BCFGR_SREN           (0x1u<<0)

#define RISAF_REG7_BCFGR_WREN_B_0X0     (0x0u<<13)
#define RISAF_REG7_BCFGR_WREN_B_0X1     (0x1u<<13)
#define RISAF_REG7_BCFGR_RDEN_B_0X0     (0x0u<<12)
#define RISAF_REG7_BCFGR_RDEN_B_0X1     (0x1u<<12)
#define RISAF_REG7_BCFGR_PRIV_B_0X0     (0x0u<<9)
#define RISAF_REG7_BCFGR_PRIV_B_0X1     (0x1u<<9)
#define RISAF_REG7_BCFGR_SEC_B_0X0      (0x0u<<8)
#define RISAF_REG7_BCFGR_SEC_B_0X1      (0x1u<<8)
#define RISAF_REG7_BCFGR_RLOCK_B_0X0    (0x0u<<1)
#define RISAF_REG7_BCFGR_RLOCK_B_0X1    (0x1u<<1)
#define RISAF_REG7_BCFGR_SREN_B_0X0     (0x0u<<0)
#define RISAF_REG7_BCFGR_SREN_B_0X1     (0x1u<<0)

// REG7_BSTARTR Configuration

#define RISAF_REG7_BSTARTR_SADDSTART    (0xFFFFFFFFu<<0)
#define RISAF_REG7_BSTARTR_SADDSTART_0  (0x1u<<0)

// REG7_BENDR Configuration

#define RISAF_REG7_BENDR_SADDEND        (0xFFFFFFFFu<<0)
#define RISAF_REG7_BENDR_SADDEND_0      (0x1u<<0)
